Osmax-Br/time_keeper_esp32/main.cpp
        if(get_date_cursor == 0){ // set the day of upload
          day_of_upload = day_of_upload_1;  //right (rtc day)
        }
        else if(get_date_cursor == 1){
          day_of_upload = day_of_upload_2; //left (rtc day -1)
        }
        
      if(selecT == "pressed" && millis() > last_option_select_time + 100 ){ //switch to uplaod screen

          last_option_select_time = millis();
          chose_date = true ; //choosed the date
      }

      /////////////////
      
    }








// **** uploading screen ****
    if(chose_date == true){ //if the date is chosen from the last screen
    display.clearDisplay();
    display.setCursor(5,0);
    display.setTextSize(2);
    display.print("END OF DAY");
    display.setTextSize(1);
    display.setCursor(0,20);
    display.print("Server: ");
    display.print(String(sql_server).substring(7,19)); //the ip address of server
     display.setCursor(20,35);
     display.print("the day : ");
     char temp_date_print[30];
     sprintf(temp_date_print,"%02i/%02i",day_of_upload,month_of_upload);
     display.print(temp_date_print);  // the chosen date of upload (from last screen)
     int activity_print_counter = 0;  // for printing the progress bar on screen
    for(int i = 0; i<4 ; i++){  // 4 pages
      for(int j =0 ; j<12 ; j++){ // 12 activities
         // post(i,j,day_of_upload,month_of_upload);      // the actual post function
          display.setCursor(20,55);
         char uplaod_progress_message[20] = ""; // dont know why !
         display.print("uploaded ");
         display.print(activity_print_counter); // progress bar
         display.print("/52");
          display.print(uplaod_progress_message);
          display.display();
          activity_print_counter ++ ; // increase the activity counter
      }
    }
    done_uploading = true; // finished uploading (exit screen)
    
    display.display();
    
   if((selecT == "pressed" && millis() > last_option_select_time + 2000) || done_uploading == true){  // either the process is aborted or it finished
    //got_the_date_from_db = false;
    time_critical = false ; // you can turn the screen off
    options_select_mode = 0;  // go to options menu
    last_option_select_time = millis();
  }}
  
  }










}

void setup() {
  sprintf(time_counter_string,"%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);  // for initilizing the counter string

  Serial.begin(115200);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(WHITE,BLACK);
  display.setCursor(0,0);



  timer = timerBegin(0, 80, true);           	// timer 0, prescalar: 80, UP counting
  timerAttachInterrupt(timer, &onTimer, true); 	// Attach interrupt
  timerAlarmWrite(timer,1000000, true);  		// Match value= 1000000 for 1 sec. delay.
  timerAlarmEnable(timer);           			// Enable Timer with interrupt (Alarm Enable)


  //connecting to wifi , the ip address is 192.168.1.199
    connect_wifi();
    display.clearDisplay();

 
   xTaskCreatePinnedToCore(get_ntp_time,"ntp_time",10000,NULL,0,&ntp_time,1); // create a seperate task for getting the ntp time
   if(WiFi.status() == WL_CONNECTED && server_started == false){
   web_server();
   server_started = true ;
   }

}




void loop() {
counter_formatting();
// adding the value of each button to a seperate var
up = button_up.press();
down = button_down.press();
right = button_right.press();
left = button_left.press();
selecT = button_selecT.press(); // the name is with "T" not "t" due to interferance with another library :p
// adding the values of bounce press vars
selecT_bounce = button_selecT.bounce_press(); 

if(selecT == "long_pressed" ){ //this is for entering the grid mode or main screen
  if(select_mode == 1){
    select_mode = 0;
  }
  else if(select_mode == 0){
    select_mode = 1;
  }
}

if (select_mode == 1){
  select_mode = 0;
  grid_navigiation(); // the grid navigiation & selection & invertion function
}
else if(select_mode == 0){
  main_screen();
  if(selecT == "pressed" && (select_mode == 0 || select_mode == 1) && chosen_value != "Nothing"){ // pressing sclect while screen is off doesnt change pause value (select_mode 3)
    if(paused == false){
      paused = true;
    }
  else if(paused == true){
    paused = false;
  }  
  }
}
else if(select_mode == 4) {
  display.clearDisplay();
  drop_screen();
} 

if(WiFi.status() != WL_CONNECTED && millis() > connection_begin + 3600000){ // if wifi isnt connected , try to connect every 1 hour
  connect_wifi();
}
 
 if(down == "long_pressed" && select_mode == 0){
  select_mode = 4;
 }
 else if(select_mode == 4 && up == "long_pressed"){
  select_mode = 0;
 }


screen_off();

if(WiFi.status() == WL_CONNECTED && server_started == false){
   web_server();
   server_started = true ;
}
   
display.display();
}
 